VoltCyclone/hurra-fpga/firmware/mcxn947/src/link.c
// The FPGA injection link. Portable transport predicates first; every MMIO
// access lives in the single trailing `#if defined(MCXN947)` block, so a host
// build of this file sees no vendor header at all.

#include "link.h"
#include "dbg_uart.h"

void link_build_idle_slot(uint8_t slot[INJ_FRAME_SIZE])
{
    // spi_frame_pack() checks type and length before writing a byte, and IDLE
    // with length 0 never dereferences the payload pointer, so NULL is correct
    // rather than merely tolerated. The return can only be SPI_FRAME_OK.
    (void)spi_frame_pack(slot, INJ_TYPE_IDLE, 0u, NULL, 0u);
}

bool link_slot_is_inert_idle(const uint8_t slot[INJ_FRAME_SIZE])
{
    return spi_frame_unpack(slot, NULL, NULL, NULL, NULL) == SPI_FRAME_IDLE;
}

uint8_t link_next_bank(uint8_t bank)
{
    return (uint8_t)((bank + 1u) & (LINK_SLOT_BANKS - 1u));
}

#if defined(MCXN947)

#include "fsl_clock.h"
#include "fsl_device_registers.h"
#include "fsl_edma.h"
#include "fsl_gpio.h"
#include "fsl_lpflexcomm.h"
#include "fsl_lpspi.h"
#include "fsl_port.h"

#include "shared_window.h"

// The step-3 portable halves. Both are MMIO-free and host-tested in their own
// right; they are included inside the guard so that a host build of this file
// still links against nothing but spi_frame.c, as test/link_test.c does.
#include "link_recovery.h"
#include "link_retire.h"

// PLATFORM_CORE_HZ, for the FlexComm6 divider static assert below, and
// platform_ticks() for the report cadence. Portable header; nothing in it is
// MMIO.
#include "platform.h"

// --- Board wiring: mikroBUS J6, LP_FLEXCOMM6 -------------------------------
//
// The four data pins and their FlexComm roles, from the FRDM-MCXN947 pin
// tables in the SDK's own board packages (the `pin_signal` strings, e.g.
// `PIO3_23/FC6_P3/CT_INP11/PWM1_X3/FLEXIO0_D31/SAI1_TXD1` carrying
// `label: 'P3_23/J6[3]'`):
//
//   J6[6] MOSI  P3_20  FC6_P0  LPSPI SOUT pad   FPGA -> MCU, so an INPUT here
//   J6[4] SCK   P3_21  FC6_P1  LPSPI SCK
//   J6[5] MISO  P3_22  FC6_P2  LPSPI SIN pad    MCU -> FPGA, so an OUTPUT here
//   J6[3] CS    P3_23  FC6_P3  LPSPI PCS0
//
// FCn_P0 is LPSPI SOUT: the SDK's own LPSPI slave example labels
// `PIO0_24/FC1_P0/...` as `LPSPI1_SOUT`. The mikroBUS socket is wired for the
// *board* to be master, so its MOSI net lands on the SOUT pad. We are the
// slave, which is what CFGR1[PINCFG] below exists to fix.
#define LINK_SPI LPSPI6
#define LINK_FLEXCOMM_INSTANCE 6u
#define LINK_PORT PORT3
#define LINK_PIN_MOSI 20u
#define LINK_PIN_SCK 21u
#define LINK_PIN_MISO 22u
#define LINK_PIN_CS 23u

// The ALT numbers are NOT the position of `FC6_Pn` in the pin_signal string --
// that string also lists functions with no mux slot (WUU0_IN*, TRIG_*, analog)
// and reading it as a dense ALT list gives the wrong answer on three of these
// four pins.
//
// The rule, derived by pairing every `/* Pin is configured as FCn_Pm */`
// comment in every FRDM/EVK pin_mux.c with the `kPORT_MuxAltN` it programs,
// over 787 configured pins with no counterexample in either direction:
//
//     a pin offering ONE FlexComm     -> that FlexComm is ALT2   (136 cases)
//     a pin offering TWO FlexComms    -> the first is ALT2       (643 cases)
//                                        the second is ALT3      (8 cases)
//
// P3_20/21/22 each offer FC8 first and FC6 second, so FC6 is ALT3. P3_23
// offers FC6 *only*, so there FC6 is ALT2. **That one pin is the odd one out,
// and it is the chip select** -- muxing it to ALT3 with its neighbours leaves
// PCS0 unconnected, the slave never frames, and the symptom is not an error
// but total silence with every FPGA counter flat.
#define LINK_ALT_DATA kPORT_MuxAlt3
#define LINK_ALT_CS kPORT_MuxAlt2

// `mcu_ready`, J5 pin 2 (ME_INT). Plain GPIO output, PORT mux ALT0.
//
// PORT5/GPIO5 have no kCLOCK_Port5/kCLOCK_Gpio5 gate: fsl_clock.h's list stops
// at Port4/Gpio4, because this is a VBAT-domain always-on pad (design doc
// section 2 notes the same thing when rejecting P5_7 for timer capture). The
// SDK's own mc_pmsm example writes PORT5->PCR[] with no clock enable, which is
// the evidence that none is needed. Nothing here enables one, and there is no
// enumerator to enable if it turned out to be required.
#define LINK_READY_PORT PORT5
#define LINK_READY_GPIO GPIO5
#define LINK_READY_PIN 7u

// eDMA0 channels. Channel numbers are otherwise free; these two are reserved
// to the link for the life of the project, and design doc section 7 rung 5
// will assert that no CPU1 symbol touches eDMA0 at all.
#define LINK_DMA DMA0
#define LINK_DMA_CHANNEL_TX 0u
#define LINK_DMA_CHANNEL_RX 1u

// FlexComm6 functional clock. **FRO_HF is not an option here.**
// BOARD_BootClockPLL150M leaves FRO_HF at 48 MHz (its own YAML header says
// `{id: FRO_HF_clock.outFreq, value: 48 MHz}`), and LP2 requires
// SCK <= f_periph/4, so 48 MHz caps SCK at 12 MHz against the 15 MHz the FPGA
// clocks -- kFRO_HF_DIV_to_FLEXCOMM6 would be a silent protocol violation.
//
// PLL0 is already at 150 MHz from the same profile, so route it through
// PLLCLKDIV (untouched by the board profile, hence set explicitly here) and
// halve it: 75 MHz, which is SCK x 5.
#define LINK_FLEXCOMM_CLOCK_DIV 2u
#define LINK_FLEXCOMM_CLOCK_HZ (PLATFORM_CORE_HZ / LINK_FLEXCOMM_CLOCK_DIV)
_Static_assert(LINK_FLEXCOMM_CLOCK_HZ >= 4u * 15000000u,
               "LP2 requires the FlexComm6 functional clock to be at least 4x SCK");

// FIFO watermarks. The LPSPI request asserts while the TX FIFO holds TXWATER
// words or fewer, so the DMA tops the FIFO up to TXWATER + 1 and then stops.
// The FIFO is 8 x 32 bits = 256 bits = exactly one slot, so **only TXWATER = 7
// actually stages a whole frame before CS falls**, which is the property design
// doc section 3 rests its "CPU0 has no latency deadline" argument on. A
// half-full FIFO would still work at these rates but would give that argument
// away for nothing, and it is margin against the transmit underrun that
// ERR051588 turns into FIFO-pointer corruption.
//
// RXWATER = 0 requests as soon as one word has landed, which is the least
// overrun-prone setting.
//
// Consequence worth carrying into step 3: with the FIFO kept full, the TX ring
// runs one whole slot ahead of the wire. The bank the DMA is loading is not the
// bank being clocked out, which is exactly why section 4's rule is "only ever
// refill the buffer the DMA is *not* pointing at". At this step both banks hold
// the same inert IDLE slot, so the lookahead is unobservable.
#define LINK_TX_WATERMARK 7u
#define LINK_RX_WATERMARK 0u

