VoltCyclone/hurra-fpga/firmware/mcxn947/src/link.c
// Slot banks. Plain SRAM: this part's Cortex-M33 has no core data cache, and
// PROVENANCE.md records that the vendored linker script has no NonCacheable
// *region* -- the attribute would collect into ordinary .data and buy nothing.
static uint8_t s_tx_bank[LINK_SLOT_BANKS][INJ_FRAME_SIZE] __attribute__((aligned(4)));
static uint8_t s_rx_bank[LINK_SLOT_BANKS][INJ_FRAME_SIZE] __attribute__((aligned(4)));

// In-memory scatter-gather descriptors. The hardware reads these directly at
// major-loop completion and never writes them, so each reload restores that
// bank's SADDR/DADDR verbatim and the ring runs forever untouched by the CPU.
// 32-byte alignment is a hardware requirement, not a preference: a misaligned
// TCD raises an eDMA error instead of transferring.
static edma_tcd_t s_tx_tcd[LINK_SLOT_BANKS] __attribute__((aligned(32)));
static edma_tcd_t s_rx_tcd[LINK_SLOT_BANKS] __attribute__((aligned(32)));

// --- Step-3 state ----------------------------------------------------------
//
// s_rx_cursor is the next RX bank to retire. It is NOT a model of where the
// DMA is -- that is read from the live TCD every time, because a self-loading
// scatter-gather ring never tells the CPU when it reloaded (link_retire.h
// explains why a software `bank ^= 1` would be wrong after a recovery or a
// missed completion). The cursor only records how far retirement has got.
//
// Written by the RX ISR and by link_dma_rings_install(), which only ever runs
// with the channel request off and the IRQ masked. Read nowhere else.
static uint8_t s_rx_cursor;

// ISR-side liveness and shortfall, the pair that separates "the DMA stopped"
// from "we stopped retiring". s_isr_entries counts major-loop completions
// delivered to the CPU; link_retire_counters()->slots counts banks actually
// retired. The two must track 1:1 -- a completion that finds the cursor
// already on the live bank retires nothing and is a lost slot.
static volatile uint32_t s_isr_entries;
static volatile uint32_t s_retire_stalls;
static volatile uint32_t s_daddr_out_of_range;

// ERR051588 accounting. A nonzero s_recoveries in normal operation is a bug,
// not routine -- design doc section 4 says so and this is the counter it means.
static uint32_t s_recoveries;
static uint32_t s_framing_recoveries;
static uint32_t s_recovery_wait_timeouts;
static uint32_t s_recovery_fill_timeouts;
static uint32_t s_recovery_last_ms;
static uint32_t s_last_fault_sr;

static void link_dma_rings_install(void);

// Last value driven onto the line. `mcu_ready` is an output with no readback
// path in this design -- GPIO_PortSet/Clear are write-only register writes --
// so the only way the console can report the link's ready state is for the
// one function that drives it to remember what it drove.
static bool s_ready;

void link_mcu_ready_set(bool ready)
{
    s_ready = ready;
    if (ready) {
        GPIO_PortSet(LINK_READY_GPIO, 1uL << LINK_READY_PIN);
    } else {
        GPIO_PortClear(LINK_READY_GPIO, 1uL << LINK_READY_PIN);
    }
}

static void link_pins_init(void)
{
    CLOCK_EnableClock(kCLOCK_Port3);
    // GPIO3 as well as PORT3: link_wait_for_interframe_gap() reads the chip
    // select out of GPIO3->PDIR while the pin is muxed to LPSPI6, and PDIR
    // reads zero forever without this gate whatever the pad is doing.
    CLOCK_EnableClock(kCLOCK_Gpio3);

    // Fast slew and the input buffer enabled on all four: at 15 MHz SCK the
    // slow-slew pad would not settle, and PCS/SCK/data all need to be readable
    // by the peripheral. No pull on any of them -- the FPGA drives CS, SCK and
    // MOSI actively, and MISO is ours to drive.
    const port_pin_config_t pin = {
        .pullSelect = kPORT_PullDisable,
        .pullValueSelect = kPORT_LowPullResistor,
        .slewRate = kPORT_FastSlewRate,
        .passiveFilterEnable = kPORT_PassiveFilterDisable,
        .openDrainEnable = kPORT_OpenDrainDisable,
        .driveStrength = kPORT_LowDriveStrength,
        .mux = LINK_ALT_DATA,
        .inputBuffer = kPORT_InputBufferEnable,
        .invertInput = kPORT_InputNormal,
        .lockRegister = kPORT_UnlockRegister,
    };
    port_pin_config_t cs = pin;
    cs.mux = LINK_ALT_CS;  // see LINK_ALT_CS: P3_23 is ALT2, not ALT3

    PORT_SetPinConfig(LINK_PORT, LINK_PIN_MOSI, &pin);
    PORT_SetPinConfig(LINK_PORT, LINK_PIN_SCK, &pin);
    PORT_SetPinConfig(LINK_PORT, LINK_PIN_MISO, &pin);
    PORT_SetPinConfig(LINK_PORT, LINK_PIN_CS, &cs);

    // `mcu_ready` starts LOW and stays low until both DMA directions are armed
    // and LPSPI6 is enabled. While it is low the FPGA latches transfer_ready
    // low at every slot start and ignores whatever we return, so a half-built
    // link cannot be validated against.
    PORT_SetPinMux(LINK_READY_PORT, LINK_READY_PIN, kPORT_MuxAlt0);
    const gpio_pin_config_t ready = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0u,
    };
    GPIO_PinInit(LINK_READY_GPIO, LINK_READY_PIN, &ready);
}

static void link_spi_init(void)
{
    CLOCK_AttachClk(kPLL0_to_PLLCLKDIV);
    CLOCK_SetClkDiv(kCLOCK_DivPllClk, 1u);
    CLOCK_SetClkDiv(kCLOCK_DivFlexcom6Clk, LINK_FLEXCOMM_CLOCK_DIV);
    CLOCK_AttachClk(kPLL_DIV_to_FLEXCOMM6);

    // Enables the FlexComm clock, clears its reset, and selects LPSPI. Without
    // this the LPSPI register block reads back as reserved.
    (void)LP_FLEXCOMM_Init(LINK_FLEXCOMM_INSTANCE, LP_FLEXCOMM_PERIPH_LPSPI);

    // Software reset, then flush both FIFOs, then leave the module disabled:
    // CFGR1 and TCR are only writable with CR[MEN] clear.
    LINK_SPI->CR = LPSPI_CR_RST_MASK;
    LINK_SPI->CR = LPSPI_CR_RTF_MASK | LPSPI_CR_RRF_MASK;
    LINK_SPI->CR = 0u;

    LINK_SPI->CFGR1 = LPSPI_CFGR1_MASTER(0u)      // slave; the FPGA drives SCK
                      | LPSPI_CFGR1_PCSPOL(0u)    // PCS0 active low
                      | LPSPI_CFGR1_OUTCFG(0u)    // retain last value off-CS
                      // PINCFG 0b11 = "SOUT is used for input data; SIN is
                      // used for output data". The mikroBUS socket names its
                      // nets for a *master* board, so the FPGA's MOSI arrives
                      // on our SOUT pad (P3_20) and our reply has to leave on
                      // the SIN pad (P3_22). The default 0b00 would drive
                      // P3_20 against the FPGA's own output and listen on the
                      // wire nobody is driving.
                      | LPSPI_CFGR1_PINCFG(3u);

    LINK_SPI->FCR = LPSPI_FCR_TXWATER(LINK_TX_WATERMARK) | LPSPI_FCR_RXWATER(LINK_RX_WATERMARK);

    // TCR[BYSW] = 1. MEASURED, and it agrees with the derivation and with
    // PROVENANCE.md; the earlier `= 0` in this file did not.
    //
    // The derivation: eDMA moves 32-bit words out of a byte array on a
    // little-endian core, so the word handed to the FIFO for slot bytes b0..b3
    // is `b0 | b1<<8 | b2<<16 | b3<<24`; shifted MSB-first that puts b3 on the
    // wire first, and BYSW undoes it. fsl_lpspi.h's kLPSPI_SlaveByteSwap says
    // exactly that, and fsl_lpspi_edma.c sets BYSW from that same flag on the
    // DMA path, where there is no software marshalling either.
    //
    // The bench agrees, and the RECEIVE side is what settles it, because it is
    // read out of memory rather than inferred from a counter. With BYSW=0 the
    // eDMA wrote the FPGA's IDLE slot into s_rx_bank[] as
    // `00 00 00 68 ... 36 fe 00 00` -- every 32-bit word byte-reversed -- and
    // a software-polled read of RDR returned 0x68000000 for slot word 0, i.e.
    // the first wire byte arrives in bits 31..24. Symmetrically the TX word for
    // slot bytes `68 00 00 00` is 0x00000068, which clocks 0x00 out first, and
    // 0x00 is exactly the `rx_sof != 0x68` the FPGA was counting. With BYSW=1
    // the same bank reads back `68 00 00 ... 00 fe 36` and spi_bad_sof stops.
    //
    // An earlier comment here claimed the opposite from a bench run in which
    // "BYSW=1 gave 7,989 bad_sof/s". That measurement cannot separate the two
    // settings: with the byte order wrong in EITHER direction every slot fails
    // its SOF check at the same 1:1 rate, so 1:1 bad_sof is what BOTH values
    // look like if anything else in the chain is also wrong. It is a
    // saturated counter, not a discriminator. The RX bank is the discriminator
    // and it is unambiguous.
    LINK_SPI->TCR = LPSPI_TCR_CPOL(0u)   // mode 0
                    | LPSPI_TCR_CPHA(0u) // mode 0
                    | LPSPI_TCR_LSBF(0u) // MSB first
                    | LPSPI_TCR_BYSW(1u)
                    | LPSPI_TCR_PCS(0u)
                    | LPSPI_TCR_WIDTH(0u)  // single-bit, not dual/quad
                    | LPSPI_TCR_FRAMESZ(LINK_SPI_FRAMESZ);

    LINK_SPI->DER = LPSPI_DER_TDDE_MASK | LPSPI_DER_RDDE_MASK;
}

// Build one direction's two-descriptor ring and install its first descriptor.
// `peripheralAddr` is TDR or RDR; `toPeripheral` picks which side increments.
static void link_dma_ring_init(uint32_t channel,
                               edma_tcd_t tcd[LINK_SLOT_BANKS],
                               uint8_t bank_storage[LINK_SLOT_BANKS][INJ_FRAME_SIZE],
                               // RDR is declared read-only, TDR write-only, so the
                               // one parameter that can name either has to carry const.
                               const volatile uint32_t *peripheral,
                               bool to_peripheral,
                               int32_t request_source,
                               uint16_t interrupt_mask)
{
    for (uint8_t bank = 0u; bank < LINK_SLOT_BANKS; ++bank) {
        edma_transfer_config_t transfer = {
            .srcAddr = to_peripheral ? (uint32_t)bank_storage[bank] : (uint32_t)peripheral,
            .destAddr = to_peripheral ? (uint32_t)peripheral : (uint32_t)bank_storage[bank],
            .srcTransferSize = kEDMA_TransferSize4Bytes,
            .destTransferSize = kEDMA_TransferSize4Bytes,
            .srcOffset = to_peripheral ? (int16_t)LINK_DMA_MINOR_BYTES : (int16_t)0,
            .destOffset = to_peripheral ? (int16_t)0 : (int16_t)LINK_DMA_MINOR_BYTES,
            // One word per peripheral request, eight requests per slot.
            .minorLoopBytes = LINK_DMA_MINOR_BYTES,
            .majorLoopCounts = LINK_DMA_MAJOR_ITER,
            // INTMAJOR on the RX ring and nothing on the TX ring. The rings
            // self-load either way -- the interrupt is not what keeps them
            // turning -- but a completed RX bank has to be retired before the
            // engine comes round to overwrite it, and a bank is 125 us wide.
            .enabledInterruptMask = interrupt_mask,
        };

        // EDMA_TcdSetTransferConfig documents that the caller must reset the
        // descriptor first -- it ORs and ANDs CSR rather than assigning it,
        // and relies on EDMA_TcdReset having set DREQ.
        EDMA_TcdReset(&tcd[bank]);
        // A non-NULL `nextTcd` is what makes this a ring: it sets CSR[ESG] and
        // clears CSR[DREQ], so at major-loop completion the engine loads the
        // next descriptor instead of disarming the channel. Pointing the last
        // descriptor back at the first closes the loop, and nothing else is
        // ever needed to keep it turning. `spi_slots` stuck at 1 on the FPGA
        // is the signature of this not having taken.
        EDMA_TcdSetTransferConfig(&tcd[bank], &transfer, &tcd[link_next_bank(bank)]);
    }

