VoltCyclone/hurra-fpga/firmware/mcxn947/src/link.c
static void link_dump_bytes(const char *tag, const uint8_t *p, uint32_t n)
{
    dbg_puts(tag);
    dbg_puts("\n  ");
    for (uint32_t i = 0u; i < n; ++i) {
        static const char digits[] = "0123456789abcdef";
        dbg_putc(digits[(p[i] >> 4) & 0xFu]);
        dbg_putc(digits[p[i] & 0xFu]);
        dbg_putc(' ');
    }
    dbg_puts("\n");
}

// Watch the live peripheral for a while and report what MOVED, rather than a
// single instantaneous sample. A stuck link and a running one look identical
// in one snapshot of SR.
static void link_watch(void)
{
    uint32_t sr_or = 0u;
    uint32_t rxcount_max = 0u;
    uint32_t txcount_min = 0xFFFFFFFFu;
    uint32_t citer_tx_seen = 0u;
    uint32_t citer_rx_seen = 0u;
    uint32_t saddr_first = LINK_DMA->CH[LINK_DMA_CHANNEL_TX].TCD_SADDR;
    uint32_t saddr_changed = 0u;

    for (uint32_t n = 0u; n < 300000u; ++n) {
        sr_or |= LINK_SPI->SR;
        uint32_t fsr = LINK_SPI->FSR;
        uint32_t rxc = (fsr & LPSPI_FSR_RXCOUNT_MASK) >> LPSPI_FSR_RXCOUNT_SHIFT;
        uint32_t txc = (fsr & LPSPI_FSR_TXCOUNT_MASK) >> LPSPI_FSR_TXCOUNT_SHIFT;
        if (rxc > rxcount_max) {
            rxcount_max = rxc;
        }
        if (txc < txcount_min) {
            txcount_min = txc;
        }
        citer_tx_seen |= 1uL << (LINK_DMA->CH[LINK_DMA_CHANNEL_TX].TCD_CITER_ELINKNO & 0xFu);
        citer_rx_seen |= 1uL << (LINK_DMA->CH[LINK_DMA_CHANNEL_RX].TCD_CITER_ELINKNO & 0xFu);
        if (LINK_DMA->CH[LINK_DMA_CHANNEL_TX].TCD_SADDR != saddr_first) {
            saddr_changed = 1u;
        }
    }

    dbg_puts("-- watch (OR/extremes over ~300k samples) --\n");
    link_show("SR   (or)    ", sr_or);
    link_show("FSR rxcnt max", rxcount_max);
    link_show("FSR txcnt min", txcount_min);
    link_show("tx CITER seen", citer_tx_seen);
    link_show("rx CITER seen", citer_rx_seen);
    link_show("tx SADDR movd", saddr_changed);
    dbg_puts("  (SR bits: 0=TDF 1=RDF 8=WCF 9=FCF 10=TCF 11=TEF 12=REF 24=MBF)\n");
    dbg_puts("  (CITER seen is a BITMASK of observed values; one bit => frozen)\n");
}

// --- RX retirement ---------------------------------------------------------

// Retire every bank between the cursor and the one the DMA is currently
// writing. Bounded by LINK_SLOT_BANKS iterations by construction: the loop
// stops at `active`, and `active` is always a valid bank index.
//
// This is design doc section 4's "only ever touch the bank the DMA is *not*
// pointing at", implemented rather than assumed. The live TCD destination
// address is the only thing on this part that knows where the engine is; see
// link_retire.h for why a software ping-pong counter is not a substitute.
static void link_drain_rx(void)
{
    uint8_t active;

    if (!link_retire_active_bank(LINK_DMA->CH[LINK_DMA_CHANNEL_RX].TCD_DADDR,
                                 (uint32_t)s_rx_bank[0], INJ_FRAME_SIZE,
                                 (uint8_t)LINK_SLOT_BANKS, &active)) {
        // The destination address is not inside the bank array at all: a
        // corrupted or never-installed descriptor. Retire nothing -- there is
        // no bank that can be shown to be safe.
        s_daddr_out_of_range++;
        return;
    }

    if (s_rx_cursor == active) {
        // A completion arrived but the only bank we had left to retire is the
        // one now being written. Retirement is a full rotation behind and this
        // slot is lost. Self-healing: the next completion moves `active` on
        // and the cursor is free again.
        s_retire_stalls++;
        return;
    }

    while (s_rx_cursor != active) {
        link_retire_slot(s_rx_bank[s_rx_cursor]);

        // shared_window_reset() runs after link_init() has enabled this ISR.
        // Its magic-first invalidation prevents the reset from racing this
        // writer; once magic is published, every retired slot gets exactly one
        // snapshot publication at the MCU's own ~8 kHz retirement cadence.
        if (g_shared_window.magic == SHARED_WINDOW_MAGIC) {
            const link_retire_counters_t *counters = link_retire_counters();
            link_snapshot_t snapshot = {0};
            snapshot.slot_counter = counters->slots;
            // At step 6 the MCU genuinely knows only that it has driven its
            // link-ready line. Native report count, USB phase, descriptor/map
            // generations, fault flags and last RX sequence have no source
            // yet and remain zero rather than carrying invented values.
            snapshot.link_flags = s_ready
                                      ? (uint16_t)INJ_LINK_STATUS_FLAG_RELAY_READY
                                      : 0u;
            link_snapshot_publish(&g_shared_window.snapshot, &snapshot);
        }
        s_rx_cursor = link_next_bank(s_rx_cursor);
    }
}

// eDMA0 channel 1 major-loop completion: one received slot.
//
// The name is `EDMA_0_CH1_DriverIRQHandler`, not `EDMA_0_CH1_IRQHandler`. The
// vector table entry is a weak trampoline that branches to the Driver name,
// and it is the Driver name that startup_MCXN947_cm33_core0.S `.set`s to
// DefaultISR -- so rooting the vector name would pass the "is it defined?"
// question against the vendor's own trampoline and prove nothing. The
// Makefile's CORE0_RETAIN roots this symbol and `make check` asserts it is a
// strong definition owned by this object.
//
// Retirement runs HERE and not in the foreground. A two-bank ring gives 250 us
// of slack; a foreground that also drives a 115200-baud report spends ~17 ms
// inside one print and would miss seventy rotations. The cost is ~10 us of ISR
// per 125 us slot, nearly all of it the bitwise CRC-16 over 30 bytes.
void EDMA_0_CH1_DriverIRQHandler(void);
void EDMA_0_CH1_DriverIRQHandler(void)
{
    // Clear the channel interrupt request before retiring rather than after.
    // CH_INT is a single W1C bit, so a completion that lands while we are
    // draining coalesces into the next entry either way -- but clearing first
    // means that entry actually happens instead of being cleared away.
    LINK_DMA->CH[LINK_DMA_CHANNEL_RX].CH_INT = DMA_CH_INT_INT_MASK;
    s_isr_entries++;
    link_drain_rx();
}

// --- Frame alignment -------------------------------------------------------
//
// THE MEASUREMENT. A boot can come up with the whole 256-bit slot permanently
// offset, and it is boot-random: two consecutive flashes of a byte-identical
// image, nothing else changed, came up 69 bits out and then perfectly aligned.
// The offset does not decay -- it held for the entire 20 s the board ran.
//
// It is invisible to every status register. No underrun, no overrun, no DMA
// error; SR reads exactly as it does on a healthy link. On the FPGA the only
// symptom is spi_bad_sof at 1:1 with spi_slots, which is the saturated
// non-discriminating signature step 2 already recorded for any whole-slot
// corruption. It was only nameable once retirement made the received bytes
// readable: decoded, the stream was the FPGA's own IDLE keepalive rotated right
// by exactly 69 bits.
//
// THE HYPOTHESIS, which is weaker than the measurement. Enabling the module
// mid-burst leaves the boundary wherever the burst had got to. Waiting for the
// gap between frames before setting CR[MEN] should therefore start it clean.
// Reading the chip select while LPSPI6 is disabled is what that needs, and
// SR[MBF] cannot serve -- a disabled module reports nothing. GPIO3->PDIR can:
// PDIR reflects the pad whatever the PORT mux selects, provided PCR[IBE] is
// set, which link_pins_init() sets on all four link pins for the peripheral's
// own benefit. So the chip select is readable as a plain input at the same time
// as it is wired to PCS0.
//
// EVIDENCE FOR IT: 7 of 7 boots clean with this wait, against 1 of 2 without.
// Suggestive, not proven -- n = 2 on the control side -- and three deliberate
// attempts to reproduce the offset at run time all failed (see
// link_demo_perturb_rx). The mechanism is NOT established, and a claim resting
// on "the boundary is latched at CR[MEN]" should not be built on this.
//
// WHAT THE FRAMING MONITOR DOES AND DOES NOT BUY, corrected against the
// 20-boot experiment that closed step 3 and superseded what stood here:
//
//   * A RECOVERY whose own re-arm lands mis-framed IS repaired. Measured on
//     the bench -- detected and corrected 60 ms later at a cost of 480 bad
//     slots, after which the link ran flat.
//   * A BOOT that comes up mis-framed is NOT. Measured: the ladder ran ~220
//     times against one such boot and never repaired it. It needs a reset.
//     See PROVENANCE.md and design doc section 10.
//
// So the wait is not best-effort scaffolding backed by a converging monitor,
// and the sentence that used to end this block -- "alignment converges rather
// than depending on a lucky boot" -- was measured false. The wait is the only
// mitigation there is for the boot case (20/20 with it, 16/20 without), and
// the monitor's role there is to NAME the condition, not to fix it.
#define LINK_GAP_WAIT_SPINS 4000000u

// Wait for chip select to be ASSERTED and then RELEASED, so what follows is the
// start of an idle window rather than its tail. At 8 kHz with a ~17 us burst
// the idle window is ~108 us, which is an eternity next to the two register
// writes that follow. Returns false if either edge did not arrive inside the
// spin budget -- the caller proceeds anyway, because an unaligned link that the
// monitor will repair beats a link that never comes up at all.
#if !defined(LINK_SKIP_GAP_WAIT)
static bool link_wait_for_interframe_gap(void)
{
    const uint32_t cs = 1uL << LINK_PIN_CS;  // active low
    uint32_t spins = 0u;

    while ((GPIO3->PDIR & cs) != 0u) {
        if (++spins >= LINK_GAP_WAIT_SPINS) {
            return false;
        }
    }
    spins = 0u;
    while ((GPIO3->PDIR & cs) == 0u) {
        if (++spins >= LINK_GAP_WAIT_SPINS) {
            return false;
        }
    }
    return true;
}
#endif  // !LINK_SKIP_GAP_WAIT

