VoltCyclone/hurra-fpga/firmware/mcxn947/src/link.c
static uint32_t s_gap_wait_timeouts;

// Enable LPSPI6 on a frame boundary. The only place CR[MEN] is ever set.
static void link_spi_enable_aligned(void)
{
    // TEMPORARY EXPERIMENT SWITCH -- REMOVE WITH THE SCAFFOLDING.
    // -DLINK_SKIP_GAP_WAIT builds the control arm: enable the module without
    // waiting for the inter-frame gap. The gap wait is a HYPOTHESIS about the
    // boot-random frame offset, measured at 7/7 clean with it and 1/2 without,
    // and n=2 is not a prior. This switch exists to get one -- and it has now
    // given one: 20/20 clean with the wait against 16/20 without.
    //
    // The line that used to stand here called the control arm safe "because
    // link_retire_framing_lost() + the section 4 ladder repair a mis-framed
    // boot within ~60 ms". That was measured false; the ladder does not repair
    // a mis-framed boot at all. A control-arm boot that comes up offset stays
    // offset until it is reset. The switch is safe to build, not to rely on.
#if !defined(LINK_SKIP_GAP_WAIT)
    if (!link_wait_for_interframe_gap()) {
        s_gap_wait_timeouts++;
    }
#endif
    LINK_SPI->CR = LPSPI_CR_MEN_MASK;
}

// --- ERR051588 -------------------------------------------------------------

// Bounded spin for CH_CSR[ACTIVE] to fall. A channel is at most one 4-byte
// minor loop from idle once its request is off, so this is orders of magnitude
// more than needed; it exists so a wedged controller cannot hang the recovery.
#define LINK_RECOVERY_WAIT_SPINS 100000u

// Storm guard: the minimum gap between two recoveries. See link_poll().
#define LINK_RECOVERY_MIN_GAP_MS 20u

static void link_read_fault(link_fault_t *fault)
{
    const uint32_t sr = LINK_SPI->SR;
    const uint32_t tx_es = LINK_DMA->CH[LINK_DMA_CHANNEL_TX].CH_ES;
    const uint32_t rx_es = LINK_DMA->CH[LINK_DMA_CHANNEL_RX].CH_ES;
    const uint32_t tx_csr = LINK_DMA->CH[LINK_DMA_CHANNEL_TX].CH_CSR;
    const uint32_t rx_csr = LINK_DMA->CH[LINK_DMA_CHANNEL_RX].CH_CSR;

    fault->lpspi_transmit_error = (sr & LPSPI_SR_TEF_MASK) != 0u;
    fault->lpspi_receive_error = (sr & LPSPI_SR_REF_MASK) != 0u;
    fault->dma_channel_error = ((tx_es | rx_es) & DMA_CH_ES_ERR_MASK) != 0u;
    fault->dma_controller_halted = (LINK_DMA->MP_CSR & DMA_MP_CSR_HALT_MASK) != 0u;
    // Read, reported, and deliberately not acted on. See link_recovery.h: DONE
    // is sticky status that a scatter-gather reload never clears, so on a
    // healthy self-loading ring it reads set forever.
    fault->dma_channel_done_latched = ((tx_csr | rx_csr) & DMA_CH_CSR_DONE_MASK) != 0u;

    // The one term that comes from the retired content rather than a register.
    // Filled in by link_poll(), which owns the sampling window.
    fault->receive_framing_lost = false;
}

// One rung of design doc section 4's ladder. The ORDER is not decided here --
// link_recovery.c owns it and test/link_recovery_test.c asserts each ordering
// clause the design states. This function only knows how to perform a rung.
static void link_recovery_apply(void *ctx, link_recovery_op_t op)
{
    (void)ctx;

    switch (op) {
    case LINK_RECOVERY_OP_MCU_READY_LOW:
        // Rung 1, and it must be first. `send_message = mcu_ready & tx_queued`
        // on the FPGA, so this stops it consuming what we emit; and all four
        // spi_bad_* counters are gated on `transfer_ready`, latched from this
        // pin at slot start, so the garbage still in flight is ignored rather
        // than counted against us.
        link_mcu_ready_set(false);
        break;

    case LINK_RECOVERY_OP_REQUESTS_OFF:
        EDMA_DisableChannelRequest(LINK_DMA, LINK_DMA_CHANNEL_TX);
        EDMA_DisableChannelRequest(LINK_DMA, LINK_DMA_CHANNEL_RX);
        // Mask the retirement ISR for the same window. Nothing may retire a
        // bank while the descriptors are being rewritten underneath it.
        NVIC_DisableIRQ(EDMA_0_CH1_IRQn);
        break;

    case LINK_RECOVERY_OP_WAIT_CHANNELS_IDLE: {
        uint32_t spins = 0u;
        while (((LINK_DMA->CH[LINK_DMA_CHANNEL_TX].CH_CSR |
                 LINK_DMA->CH[LINK_DMA_CHANNEL_RX].CH_CSR) &
                DMA_CH_CSR_ACTIVE_MASK) != 0u) {
            if (++spins >= LINK_RECOVERY_WAIT_SPINS) {
                s_recovery_wait_timeouts++;
                break;
            }
        }
        break;
    }

    case LINK_RECOVERY_OP_RESET_FIFOS:
        // Rung 3, and the erratum's own workaround: "reset the transmit FIFO
        // (CR[RTF] = 1) before writing any new data". RRF goes with it because
        // the receive FIFO may hold the tail of a frame that no longer has a
        // matching transmit side. MEN is left alone -- RTF/RRF are
        // self-clearing commands and the vendor's own LPSPI_FlushFifo() writes
        // them with the module enabled.
        LINK_SPI->CR |= LPSPI_CR_RTF_MASK | LPSPI_CR_RRF_MASK;
        // SR's error flags are W1C. TCF is cleared with them so the next
        // frame-complete is unambiguous.
        LINK_SPI->SR = LPSPI_SR_TEF_MASK | LPSPI_SR_REF_MASK | LPSPI_SR_TCF_MASK;
        // ...and then disable the module. This is a DEVIATION from design doc
        // section 4's ladder, which does not mention MEN, and it is what makes
        // the ladder able to repair a mis-framed slave rather than only an
        // underrun one: the frame boundary is latched at MEN and a disabled
        // module ignores SCK entirely, so dropping it here is what lets rung 5
        // choose a new boundary in the inter-frame gap.
        LINK_SPI->CR &= ~(uint32_t)LPSPI_CR_MEN_MASK;
        break;

    case LINK_RECOVERY_OP_CLEAR_CHANNEL_STATE:
        // Rung 4a. DONE is cleared because the design says to, not because it
        // meant anything; ERROR and HALT are cleared because they do.
        // enableHaltOnError is true by default, so an error on either channel
        // stops BOTH, and a TCD installed into a halted controller arms
        // nothing at all.
        EDMA_ClearChannelStatusFlags(LINK_DMA, LINK_DMA_CHANNEL_TX,
                                     (uint32_t)kEDMA_DoneFlag | (uint32_t)kEDMA_ErrorFlag |
                                         (uint32_t)kEDMA_InterruptFlag);
        EDMA_ClearChannelStatusFlags(LINK_DMA, LINK_DMA_CHANNEL_RX,
                                     (uint32_t)kEDMA_DoneFlag | (uint32_t)kEDMA_ErrorFlag |
                                         (uint32_t)kEDMA_InterruptFlag);
        LINK_DMA->MP_CSR &= ~(uint32_t)DMA_MP_CSR_HALT_MASK;
        break;

    case LINK_RECOVERY_OP_REARM_RINGS:
        // Rung 4b. Re-seed both TX banks first, then rewrite the descriptors:
        // the steady-state invariant is that the buffer the DMA will next read
        // is never empty and never half written, and the moment the descriptor
        // is installed is the moment that becomes true again.
        for (uint8_t bank = 0u; bank < LINK_SLOT_BANKS; ++bank) {
            link_build_idle_slot(s_tx_bank[bank]);
        }
        link_dma_rings_install();
        break;

    case LINK_RECOVERY_OP_REQUESTS_ON: {
        NVIC_ClearPendingIRQ(EDMA_0_CH1_IRQn);
        NVIC_EnableIRQ(EDMA_0_CH1_IRQn);
        EDMA_EnableChannelRequest(LINK_DMA, LINK_DMA_CHANNEL_TX);
        EDMA_EnableChannelRequest(LINK_DMA, LINK_DMA_CHANNEL_RX);

        // The module comes back on a frame boundary, and only here -- the same
        // call the boot path uses, so there is one expression of the rule.
        link_spi_enable_aligned();

        // Do not leave until the FIFO actually holds a whole slot again. The
        // steady-state invariant is that the buffer the DMA will next read is
        // never empty; the FIFO is 8 x 32 bits = exactly one slot, and the eight
        // DMA moves that fill it take well under a microsecond against the
        // ~108 us of idle wire this rung is standing in. Leaving early would
        // hand the next frame a half-full FIFO, which underruns -- the fault,
        // again, manufactured by its own recovery.
        uint32_t spins = 0u;
        while (((LINK_SPI->FSR & LPSPI_FSR_TXCOUNT_MASK) >> LPSPI_FSR_TXCOUNT_SHIFT) <
               (LINK_TX_WATERMARK + 1u)) {
            if (++spins >= LINK_RECOVERY_WAIT_SPINS) {
                s_recovery_fill_timeouts++;
                break;
            }
        }
        break;
    }

