VoltCyclone/hurra-fpga/firmware/mcxn947/src/link.c
    case LINK_RECOVERY_OP_MCU_READY_HIGH:
        // Rung 6, and it must be last: this is the edge that makes the FPGA
        // start scoring us again, so nothing may still be half-armed.
        //
        // SR is cleared once more immediately before the edge. The window
        // between the FIFO reset in rung 3 and the refill in rung 5 is one in
        // which the FPGA is still clocking an empty transmit FIFO, so it sets
        // SR[TEF] by construction -- a fault caused by the recovery rather than
        // found by it. Leaving it latched would have the monitor read it on its
        // very next pass and recover forever, 8,000 times a second.
        LINK_SPI->SR = LPSPI_SR_TEF_MASK | LPSPI_SR_REF_MASK | LPSPI_SR_TCF_MASK;
        link_mcu_ready_set(true);
        break;

    case LINK_RECOVERY_OP_COUNT:
    default:
        break;
    }
}

static void link_recover(const link_fault_t *fault)
{
    s_recoveries++;
    if (fault->receive_framing_lost) {
        s_framing_recoveries++;
    }
    s_last_fault_sr = LINK_SPI->SR;

    dbg_puts("!! ERR051588 recovery #");
    dbg_dec32(s_recoveries);
    dbg_puts("  SR=");
    dbg_hex32(s_last_fault_sr);
    dbg_puts(fault->lpspi_transmit_error ? " TEF" : "");
    dbg_puts(fault->lpspi_receive_error ? " REF" : "");
    dbg_puts(fault->dma_channel_error ? " CH_ES" : "");
    dbg_puts(fault->dma_controller_halted ? " HALT" : "");
    dbg_puts(fault->receive_framing_lost ? " FRAMING" : "");
    dbg_puts("\n");

    (void)link_recovery_run(link_recovery_apply, NULL);

    dbg_puts("   recovered, SR=");
    dbg_hex32(LINK_SPI->SR);
    dbg_puts(" FSR=");
    dbg_hex32(LINK_SPI->FSR);
    dbg_puts(" idle_timeouts=");
    dbg_dec32(s_recovery_wait_timeouts);
    dbg_puts(" fill_timeouts=");
    dbg_dec32(s_recovery_fill_timeouts);
    dbg_puts("\n");
}

// --- The one-shot ERR051588 provocation ------------------------------------
//
// Design doc section 9 step 3: "Includes deliberately provoking ERR051588 by
// halting the core while the FPGA clocks SCK. A recovery path that has never
// run is not a recovery path."
//
// A debugger halt is NOT the mechanism, and step 2 already recorded why:
// EDMA_GetDefaultConfig leaves `enableDebugMode = false`, so the eDMA keeps
// running while the core is stopped. The rings are self-loading, so a plain
// halt does not starve the transmit FIFO and produces no underrun at all.
//
// What does produce one, deterministically and on demand, is taking the
// transmit channel's request away while the FPGA keeps clocking: the FIFO
// holds exactly one slot, so it is empty within 125 us and the next 256 clocks
// underrun. That is ERR051588's own trigger -- "a transmit FIFO underrun
// (SR[TEF]) in slave mode" -- reached by the same route a reset window or an
// error halt would reach it, and unlike a debugger halt it is repeatable.
//
// The schedule is driven by the retirement counter rather than by wall-clock,
// so every phase boundary is a fixed number of slots and the FPGA-side sampling
// windows line up with it. The three phases are arranged to make the evidence
// falsifiable:
//
//   ARMED     ~10 s of untouched steady state, so "flat before" is measured.
//   STARVING  ~1 s with the TX request off. The underrun happens here.
//   BROKEN    ~20 s with the request back ON and NO recovery. If ERR051588 did
//             not really corrupt the FIFO pointers, the link would heal itself
//             here and the FPGA counters would stay flat. They do not, and that
//             is what makes the recovery in the next phase mean something.
//   DONE      recovery has run; the automatic fault monitor is armed from here.
typedef enum {
    LINK_DEMO_ARMED = 0,
    LINK_DEMO_STARVING,
    LINK_DEMO_UNDERRUN_HELD,
    LINK_DEMO_PERTURBED_HELD,
    LINK_DEMO_DONE,
} link_demo_phase_t;

#define LINK_DEMO_ARM_SLOTS 160000u    // ~20 s at 8 kHz
#define LINK_DEMO_STARVE_SLOTS 8000u   // ~1 s
#define LINK_DEMO_HOLD_SLOTS 80000u    // ~10 s per broken window

static link_demo_phase_t s_demo_phase = LINK_DEMO_ARMED;
static uint32_t s_demo_mark;

static const char *link_demo_phase_name(void)
{
    switch (s_demo_phase) {
    case LINK_DEMO_ARMED:
        return "armed";
    case LINK_DEMO_STARVING:
        return "STARVING";
    case LINK_DEMO_UNDERRUN_HELD:
        return "UNDERRUN";
    case LINK_DEMO_PERTURBED_HELD:
        return "PERTURB";
    case LINK_DEMO_DONE:
    default:
        return "steady";
    }
}

// The automatic monitor is suppressed for exactly the windows the provocation
// owns. Everywhere else -- including before the provocation, so a fault
// inherited from the boot or from a flash cycle is caught -- it is armed.
static bool link_fault_monitor_armed(void)
{
    return s_demo_phase == LINK_DEMO_ARMED || s_demo_phase == LINK_DEMO_DONE;
}

// A NEGATIVE CONTROL, and it is labelled one because it is what it measured.
//
// The intent was to reproduce the persistent frame offset seen on a boot, by
// stealing three words out of the receive FIFO before the eDMA could move them.
// The reasoning: the ring writes eight words per bank and the FPGA clocks eight
// words per slot, so taking three away should leave every bank holding the last
// five words of one slot followed by the first three of the next, forever.
//
// IT DOES NOT. Ten seconds after the theft, `sof` is still zero and every FPGA
// counter is still flat. The receive path re-synchronises on its own.
//
// It is the third provocation to fail that way, and together they are the
// finding, which contradicts the obvious reading of the boot symptom:
//
//   * cycling CR[MEN] mid-burst -- no effect, ten seconds, not one bad slot.
//     So the frame boundary is NOT simply latched at the module enable.
//   * starving the transmit FIFO (provocation 1 above) -- sets SR[TEF] exactly
//     as ERR051588 says, and then the transmit path self-heals once the request
//     returns. Measured three times, ten seconds each.
//   * this -- the receive path likewise re-synchronises.
//
// So the link tolerates every mid-run perturbation that has been tried, and the
// persistent 69-bit offset measured once at boot has a cause none of these
// reproduces. link_spi_enable_aligned() is a hypothesis about that cause with
// 7 of 7 clean boots behind it and 1 of 2 before it -- suggestive, not proven --
// and the framing monitor is the backstop that makes it not matter: a boot that
// comes up mis-framed repairs itself whether or not the hypothesis is right.
//
// Kept rather than deleted because "the link survives three words stolen out of
// its receive FIFO" is a robustness property worth re-measuring after any change
// to the ring, and because a provocation nobody records having tried gets tried
// again.
static void link_demo_perturb_rx(void)
{
    // Masked, so the retirement ISR cannot drain the FIFO between the wait and
    // the read and leave us reading an empty RDR (which consumes nothing and
    // would shift nothing).
    NVIC_DisableIRQ(EDMA_0_CH1_IRQn);
    for (uint32_t word = 0u; word < 3u; ++word) {
        uint32_t spins = 0u;
        while (((LINK_SPI->FSR & LPSPI_FSR_RXCOUNT_MASK) >> LPSPI_FSR_RXCOUNT_SHIFT) == 0u) {
            if (++spins >= LINK_GAP_WAIT_SPINS) {
                break;
            }
        }
        (void)LINK_SPI->RDR;
    }
    NVIC_EnableIRQ(EDMA_0_CH1_IRQn);
}

static void link_demo_step(uint32_t slots)
{
    switch (s_demo_phase) {
    case LINK_DEMO_ARMED:
        if (slots >= LINK_DEMO_ARM_SLOTS) {
            dbg_puts("\n-- provocation 1/2: ERR051588, TX DMA request off --\n");
            EDMA_DisableChannelRequest(LINK_DMA, LINK_DMA_CHANNEL_TX);
            s_demo_mark = slots;
            s_demo_phase = LINK_DEMO_STARVING;
        }
        break;

    case LINK_DEMO_STARVING:
        if (slots - s_demo_mark >= LINK_DEMO_STARVE_SLOTS) {
            const uint32_t sr = LINK_SPI->SR;
            EDMA_EnableChannelRequest(LINK_DMA, LINK_DMA_CHANNEL_TX);
            dbg_puts("-- TX request back on, monitor still OFF. SR=");
            dbg_hex32(sr);
            dbg_puts((sr & LPSPI_SR_TEF_MASK) != 0u ? "  TEF SET (underrun)\n"
                                                    : "  TEF CLEAR (no underrun!)\n");
            s_demo_mark = slots;
            s_demo_phase = LINK_DEMO_UNDERRUN_HELD;
        }
        break;

    case LINK_DEMO_UNDERRUN_HELD:
        if (slots - s_demo_mark >= LINK_DEMO_HOLD_SLOTS) {
            link_fault_t fault;
            link_read_fault(&fault);
            dbg_puts("-- running the section 4 ladder on the latched TEF --\n");
            if (link_recovery_required(&fault)) {
                link_recover(&fault);
            } else {
                dbg_puts("   nothing to recover; fault predicate says clean\n");
            }

