VoltCyclone/hurra-fpga/firmware/mcxn947/src/link.c
            dbg_puts("\n-- provocation 2/2 (negative control): steal 3 RX FIFO words --\n");
            link_demo_perturb_rx();
            s_demo_mark = slots;
            s_demo_phase = LINK_DEMO_PERTURBED_HELD;
        }
        break;

    case LINK_DEMO_PERTURBED_HELD:
        if (slots - s_demo_mark >= LINK_DEMO_HOLD_SLOTS) {
            // Nothing is called here. The monitor is simply armed, and the
            // repair has to happen on its own -- that is the whole point. A
            // ladder someone has to invoke by hand is not a recovery path.
            dbg_puts("-- monitor ARMED; a link still broken must now repair itself --\n");
            s_demo_phase = LINK_DEMO_DONE;
        }
        break;

    case LINK_DEMO_DONE:
    default:
        break;
    }
}

// --- Framing monitor -------------------------------------------------------
//
// Samples the retirement counters on a fixed cadence and asks link_retire.c
// whether anything parsed in the interval. The window has to be long enough to
// clear LINK_FRAMING_MIN_SLOTS (200 slots, ~25 ms) and short enough that a
// mis-framed boot is repaired long before anyone looks at it.
#define LINK_FRAMING_WINDOW_MS 50u

static link_framing_sample_t s_framing_previous;
static uint32_t s_framing_ms;

// Returns the verdict for the window that just closed, or false while one is
// still open. Sampling here rather than inside link_read_fault() keeps the
// window under this function's control: a verdict is only ever computed from
// two samples a whole window apart, never from two taken microseconds apart by
// a fast foreground loop.
static bool link_framing_poll(void)
{
    const uint32_t now = platform_ticks();
    if (now - s_framing_ms < LINK_FRAMING_WINDOW_MS) {
        return false;
    }
    s_framing_ms = now;

    link_framing_sample_t current;
    link_retire_framing_sample(&current);
    const bool lost = link_retire_framing_lost(&s_framing_previous, &current);
    s_framing_previous = current;
    return lost;
}

// --- Snapshots for the console ---------------------------------------------
//
// Both mask the retirement interrupt for the copy. See link.h: the ISR runs
// at 8 kHz, so an unmasked field-by-field read would splice several slots'
// worth of counters into one apparently coherent sample.

void link_counters_read(link_retire_counters_t *out)
{
    NVIC_DisableIRQ(EDMA_0_CH1_IRQn);
    *out = *link_retire_counters();
    NVIC_EnableIRQ(EDMA_0_CH1_IRQn);
}

void link_diagnostics_read(link_diagnostics_t *out)
{
    NVIC_DisableIRQ(EDMA_0_CH1_IRQn);
    out->isr_entries = s_isr_entries;
    out->retire_stalls = s_retire_stalls;
    out->daddr_out_of_range = s_daddr_out_of_range;
    NVIC_EnableIRQ(EDMA_0_CH1_IRQn);

    // The rest are foreground-only: link_poll() is their sole writer and it
    // is the same context the console runs in, so masking would assert
    // nothing.
    out->recoveries = s_recoveries;
    out->framing_recoveries = s_framing_recoveries;
    out->gap_wait_timeouts = s_gap_wait_timeouts;
    out->ready = s_ready;
}

// --- Periodic report -------------------------------------------------------

#define LINK_REPORT_MS 1000u

static uint32_t s_report_ms;

static void link_report(void)
{
    const link_retire_counters_t *c = link_retire_counters();

    dbg_puts("[");
    dbg_puts(link_demo_phase_name());
    dbg_puts("] slots=");
    dbg_dec32(c->slots);
    dbg_puts(" idle=");
    dbg_dec32(c->idle);
    dbg_puts(" deliv=");
    dbg_dec32(c->deliverable);
    dbg_puts(" sof=");
    dbg_dec32(c->bad_sof);
    dbg_puts(" crc=");
    dbg_dec32(c->bad_crc);
    dbg_puts(" len=");
    dbg_dec32(c->bad_length);
    dbg_puts(" typ=");
    dbg_dec32(c->bad_type);
    dbg_puts(" dup=");
    dbg_dec32(c->duplicate);
    dbg_puts(" stale=");
    dbg_dec32(c->stale);
    dbg_puts(" gap=");
    dbg_dec32(c->sequence_gap);
    dbg_puts("\n      isr=");
    dbg_dec32(s_isr_entries);
    dbg_puts(" stall=");
    dbg_dec32(s_retire_stalls);
    dbg_puts(" daddr_err=");
    dbg_dec32(s_daddr_out_of_range);
    dbg_puts(" recov=");
    dbg_dec32(s_recoveries);
    dbg_puts("/");
    dbg_dec32(s_framing_recoveries);
    dbg_puts("fr gapto=");
    dbg_dec32(s_gap_wait_timeouts);
    dbg_puts(" cursor=");
    dbg_dec32(s_rx_cursor);
    dbg_puts(" SR=");
    dbg_hex32(LINK_SPI->SR);
    dbg_puts(" ms=");
    dbg_dec32(platform_ticks());
    // The last bank retired, verbatim. This is the evidence that retirement is
    // reading bytes the FPGA put there: an untouched bank is all zeros, and the
    // keepalive it actually sends is 68 00 00 00 .. 00 fe 36.
    //
    // Snapshotted with the retirement ISR masked, and that is not a nicety. The
    // hex dump takes ~30 ms at 115200 baud and the ISR rewrites the source
    // buffer 240 times in that window, so printing straight from the pointer
    // splices hundreds of slots into one line -- a healthy keepalive acquires a
    // scatter of bytes it never carried, and on the bench that briefly looked
    // like wire corruption. Masking for a 32-byte copy costs tens of
    // nanoseconds against a 125 us slot.
    uint8_t snapshot[INJ_FRAME_SIZE];
    NVIC_DisableIRQ(EDMA_0_CH1_IRQn);
    for (uint32_t index = 0u; index < INJ_FRAME_SIZE; ++index) {
        snapshot[index] = link_retire_last_slot()[index];
    }
    NVIC_EnableIRQ(EDMA_0_CH1_IRQn);
    link_dump_bytes("\n      last slot", snapshot, INJ_FRAME_SIZE);
}

void link_poll(void)
{
    const uint32_t slots = link_retire_counters()->slots;

    // Sampled unconditionally, acted on only when armed. Sampling inside the
    // armed branch instead would leave s_framing_previous stale across a
    // disarmed window, so the first verdict after re-arming would be computed
    // against a sample from minutes earlier.
    const bool framing_lost = link_framing_poll();

    link_demo_step(slots);

    if (link_fault_monitor_armed()) {
        link_fault_t fault;
        link_read_fault(&fault);
        fault.receive_framing_lost = framing_lost;
        // One recovery per LINK_RECOVERY_MIN_GAP_MS at most. A recovery that
        // re-creates its own trigger would otherwise run at the poll rate and
        // do nothing but flood the UART and drop `mcu_ready` thousands of times
        // a second. Rate-limited, the same bug shows as `recov` climbing
        // steadily in the report, which is a diagnosis rather than a brick.
        const uint32_t since = platform_ticks() - s_recovery_last_ms;
        if (link_recovery_required(&fault) &&
            (s_recoveries == 0u || since >= LINK_RECOVERY_MIN_GAP_MS)) {
            s_recovery_last_ms = platform_ticks();
            link_recover(&fault);
        }
    }

