VoltCyclone/hurra-fpga/firmware/mcxn947/src/link.c
    // Wall-clock rather than slot-driven, deliberately: a link that has stopped
    // delivering slots is the case that most needs a report, and a slot-driven
    // cadence would go silent exactly then.
    const uint32_t now = platform_ticks();
    if (now - s_report_ms >= LINK_REPORT_MS) {
        s_report_ms = now;
        link_report();
    }
}

void link_init(void)
{
    dbg_uart_init();
    link_wire_probe();

    link_pins_init();
    link_mcu_ready_set(false);

    // Retirement state before anything can complete into it.
    link_retire_reset();

    for (uint8_t bank = 0u; bank < LINK_SLOT_BANKS; ++bank) {
        link_build_idle_slot(s_tx_bank[bank]);
        for (uint32_t index = 0u; index < INJ_FRAME_SIZE; ++index) {
            s_rx_bank[bank][index] = 0u;
        }
    }

    link_spi_init();
    link_dma_init();

    EDMA_EnableChannelRequest(LINK_DMA, LINK_DMA_CHANNEL_TX);
    EDMA_EnableChannelRequest(LINK_DMA, LINK_DMA_CHANNEL_RX);

    // The RX retirement interrupt, armed before the module is enabled so the
    // first completion is not missed. The RX banks are zeroed above, so if the
    // ISR somehow ran before any transfer it would retire zeros and score them
    // as bad_sof -- which is a visible failure rather than a silent one.
    NVIC_ClearPendingIRQ(EDMA_0_CH1_IRQn);
    NVIC_EnableIRQ(EDMA_0_CH1_IRQn);

    link_spi_enable_aligned();

    link_mcu_ready_set(true);

    dbg_puts("\n==== hurra mcxn947 step4: link + CDC console ====\n");

    dbg_puts("-- clocking --\n");
    link_show("PLLCLKDIVSEL ", SYSCON->PLLCLKDIVSEL);
    link_show("PLLCLKDIV    ", SYSCON->PLLCLKDIV);
    link_show("FCCLKSEL[6]  ", SYSCON->FCCLKSEL[6]);
    link_show("FC6 CLKDIV   ",
              (&(SYSCON->SYSTICKCLKDIV[0]))[(uint32_t)kCLOCK_DivFlexcom6Clk]);
    link_show("AHBCLKCTRL1  ", SYSCON->AHBCLKCTRL1);
    link_show("FC6 PSELID   ",
              ((LP_FLEXCOMM_Type *)LP_FLEXCOMM_GetBaseAddress(LINK_FLEXCOMM_INSTANCE))->PSELID);

    dbg_puts("-- LPSPI6 --\n");
    link_show("VERID        ", LINK_SPI->VERID);
    link_show("PARAM        ", LINK_SPI->PARAM);
    link_show("CR           ", LINK_SPI->CR);
    link_show("SR           ", LINK_SPI->SR);
    link_show("FSR          ", LINK_SPI->FSR);
    link_show("CFGR0        ", LINK_SPI->CFGR0);
    link_show("CFGR1        ", LINK_SPI->CFGR1);
    link_show("TCR          ", LINK_SPI->TCR);
    link_show("FCR          ", LINK_SPI->FCR);
    link_show("DER          ", LINK_SPI->DER);

    dbg_puts("-- FC6 pins --\n");
    link_show("PCR[20] MOSI ", LINK_PORT->PCR[LINK_PIN_MOSI]);
    link_show("PCR[21] SCK  ", LINK_PORT->PCR[LINK_PIN_SCK]);
    link_show("PCR[22] MISO ", LINK_PORT->PCR[LINK_PIN_MISO]);
    link_show("PCR[23] CS   ", LINK_PORT->PCR[LINK_PIN_CS]);

    dbg_puts("-- eDMA0 --\n");
    link_show("MP_CSR       ", LINK_DMA->MP_CSR);
    link_show("MP_ES        ", LINK_DMA->MP_ES);
    link_show("MP_HRS       ", LINK_DMA->MP_HRS);
    link_dump_channel("  ch0 (tx, want CH_MUX=82)\n", LINK_DMA_CHANNEL_TX);
    link_dump_channel("  ch1 (rx, want CH_MUX=81)\n", LINK_DMA_CHANNEL_RX);

    link_show("tcd tx[0] @  ", (uint32_t)&s_tx_tcd[0]);
    link_show("tcd tx[1] @  ", (uint32_t)&s_tx_tcd[1]);
    link_show("tcd rx[0] @  ", (uint32_t)&s_rx_tcd[0]);
    link_show("tcd rx[1] @  ", (uint32_t)&s_rx_tcd[1]);
    link_show("tx bank[0] @ ", (uint32_t)s_tx_bank[0]);
    link_show("rx bank[0] @ ", (uint32_t)s_rx_bank[0]);
    link_show("TDR addr     ", (uint32_t)&LINK_SPI->TDR);
    link_show("RDR addr     ", (uint32_t)&LINK_SPI->RDR);

    link_watch();

    link_delay(2000000u);

    dbg_puts("-- after traffic --\n");
    link_show("SR           ", LINK_SPI->SR);
    link_show("FSR          ", LINK_SPI->FSR);
    link_dump_channel("  ch0 (tx)\n", LINK_DMA_CHANNEL_TX);
    link_dump_channel("  ch1 (rx)\n", LINK_DMA_CHANNEL_RX);
    link_dump_bytes("-- TX bank0 --", s_tx_bank[0], INJ_FRAME_SIZE);
    link_dump_bytes("-- RX bank0 --", s_rx_bank[0], INJ_FRAME_SIZE);
    link_dump_bytes("-- RX bank1 --", s_rx_bank[1], INJ_FRAME_SIZE);

    dbg_puts("-- retirement --\n");
    link_show("isr entries  ", s_isr_entries);
    link_show("slots retired", link_retire_counters()->slots);
    link_show("idle frames  ", link_retire_counters()->idle);
    link_show("bad sof      ", link_retire_counters()->bad_sof);
    link_show("bad crc      ", link_retire_counters()->bad_crc);
    link_show("rx cursor    ", s_rx_cursor);
    {
        uint8_t snapshot[INJ_FRAME_SIZE];
        NVIC_DisableIRQ(EDMA_0_CH1_IRQn);
        for (uint32_t index = 0u; index < INJ_FRAME_SIZE; ++index) {
            snapshot[index] = link_retire_last_slot()[index];
        }
        NVIC_EnableIRQ(EDMA_0_CH1_IRQn);
        link_dump_bytes("-- last retired slot --", snapshot, INJ_FRAME_SIZE);
    }
    dbg_puts("  (a bank nothing filled reads all-zero; the FPGA keepalive is\n"
             "   68 00 00 00 .. 00 fe 36, so a non-zero slot here is wire data)\n");

    // The report cadence starts from whatever the boot dump cost, so the first
    // periodic line is one full interval away rather than immediate.
    s_report_ms = platform_ticks();
}

#endif  // MCXN947
